<!--Información del curso-->
<img align="left" style="padding-right:10px;" src="figuras/logo_ciencia_datos.png">

<center><h1 style="font-size:2em;color:#2467C0"> Pandas -Parte 6  </h1></center>

<center><h2 style="font-size:2em;color:#840700">  Ordenando  y obteniendo valores únicos de datos  </h4></center>

<br>
<table>
<col width="550">
<col width="450">
<tr>
<td><img src="figuras/agrupando.png" align="left" style="width:500px"/></td>
<td>

* **Wes McKinney**, empezó a desarrollar Pandas en el año 2008 mientras trabajaba en *AQR Capital* [https://www.aqr.com/] por la necesidad que tenía de una herramienta flexible de alto rendimiento para realizar análisis cuantitativos en datos financieros. 
* Antes de dejar AQR convenció a la administración de la empresa de distribuir esta biblioteca bajo licencia de código abierto.
* **Pandas** es un acrónimo de **PANel DAta analysiS**
   
    
<br>
</td>
</tr>
</table>

# Librerías

Cargando las bibliotecas que necesitamos

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Datos utilizados en esta Notebook

El archivo *planetas.csv* contiene datos sobre planetas que se han descubierto orbitando estrellas fuera de nuestro sistema solar. En este archivo, cada fila corresponde a un exoplaneta descubierto. Los atributos de cada exoplaneta (y por lo tanto las columnas del archivo) son:

* **método**  el método utilizado para descubrir el planeta.
* **número** el número total de planetas descubiertos orbitando la estrella anfitriona de este exoplaneta.
* **orbital_period** el período del planeta, su "año".
* **masa** la masa del exoplaneta.
* **distancia** la distancia de la estrella anfitriona del exoplaneta a la Tierra en años luz.
* **año** el año en que se descubrió el planeta.

In [2]:
#Mostrar las primeras 5 filas
df_planetas = pd.read_csv("datos/planets.csv")
df_planetas.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [3]:
#Numero total de filas y columnas
df_planetas.shape

(1035, 6)

In [4]:
#Caracteristicas de cada columna
df_planetas.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

Como se puede observar existen columnas que no tienen todos los datos (ver el parametro **count** que es diferente, solo cuenta cuando existe el dato)

#  Introducción

Una vez importado un conjunto de datos en pandas puede ser interesante ordenar el contenido de estos. Lo más habitual es ordenarlo en base a los valores de una o varias columnas. Para ordenar dataframes en pandas se pueden utilizar los métodos nativos de estos objetos. Lo que permite hacer esta tarea de un forma sencilla y eficiente.

# Ordenando datos

## Ordenar en base al valor de una columna

La primera tarea siempre es ordenar los conjuntos de datos en base a los valores de una columna. Por ejemplo, se puede ordenar los planetas en base al año de descubrimiento. Lo que se puede conseguir con la función ``sort_values()``  que se le ha de indicar el nombre de la columna por la que ordenar. Esto se puede ver en el siguiente ejemplo.

In [5]:
#Ordenar por año 
df_planetas.sort_values('year')

              method  number  orbital_period    mass  distance  year
441  Radial Velocity       1       83.888000  11.680     40.57  1989
942    Pulsar Timing       3       66.541900     NaN       NaN  1992
941    Pulsar Timing       3       25.262000     NaN       NaN  1992
943    Pulsar Timing       3       98.211400     NaN       NaN  1994
16   Radial Velocity       1        4.230785   0.472     15.36  1995
..               ...     ...             ...     ...       ...   ...
846          Transit       2       15.965400     NaN       NaN  2014
847          Transit       2      179.612000     NaN       NaN  2014
849          Transit       4        6.164860     NaN       NaN  2014
851          Transit       4       23.980200     NaN       NaN  2014
840          Transit       3       35.333100     NaN       NaN  2014

[1035 rows x 6 columns]

Lo primero que se puede observar es el hecho de que los registros se ordenan de forma ascendente. Por lo que los planetas descubiertos recientemente aparecerán al final del nuevo conjunto de datos.

In [6]:
#Encontrar los 5 registros más recientes
df_planetas.sort_values('year').tail()

      method  number  orbital_period  mass  distance  year
846  Transit       2        15.96540   NaN       NaN  2014
847  Transit       2       179.61200   NaN       NaN  2014
849  Transit       4         6.16486   NaN       NaN  2014
851  Transit       4        23.98020   NaN       NaN  2014
840  Transit       3        35.33310   NaN       NaN  2014

## Ordenar en base al valor de una columna en orden descendente

En el ejemplo anterior, si se quiere tener al principio del conjunto de datos ordenado es necesario cambiar el método de ordenación. Para ello existe la propiedad ascending que indica si se ordena de forma ascendente. El valor por defecto de esta propiedad es verdadero, por lo que solamente es necesario indicar el valor cuando se desea ordenar en orden descendente. Así para ordenar los planetas por año en orden descendente se puede es necesario escribir.

In [7]:
# Ordenar comenzando con los registros más recientes
df_planetas.sort_values('year',ascending=False)

              method  number  orbital_period    mass  distance  year
852          Transit       4       43.844500     NaN       NaN  2014
890          Transit       2        2.426290     NaN       NaN  2014
440  Radial Velocity       1     3827.000000   0.480     20.48  2014
895          Transit       1       68.958400     NaN       NaN  2014
894          Transit       1        2.465020     NaN       NaN  2014
..               ...     ...             ...     ...       ...   ...
16   Radial Velocity       1        4.230785   0.472     15.36  1995
943    Pulsar Timing       3       98.211400     NaN       NaN  1994
941    Pulsar Timing       3       25.262000     NaN       NaN  1992
942    Pulsar Timing       3       66.541900     NaN       NaN  1992
441  Radial Velocity       1       83.888000  11.680     40.57  1989

[1035 rows x 6 columns]

### Tener en cuenta los nulos a la hora de ordenar

Si en la columna del conjunto de datos que se esté ordenando existe valores nulos, por defecto estos serán puestos al final. La columna periodo orbital contiene valores nulos, al ordenar por ésta se obtiene.

In [8]:
# Ordenar considerando el campo 'orbital_period' 
df_planetas.sort_values('orbital_period')

,method,number,orbital_period,mass,distance,year
945,Pulsar Timing,1,0.090706,NaN,1200.0,2011
787,Orbital Brightness Modulation,2,0.240104,NaN,1180.0,2011
788,Orbital Brightness Modulation,2,0.342887,NaN,1180.0,2011
794,Transit,1,0.355000,NaN,NaN,2013
730,Transit,3,0.453285,NaN,38.7,2011
...,...,...,...,...,...,...
949,Imaging,1,NaN,NaN,120.0,2013
950,Imaging,1,NaN,NaN,NaN,2010
957,Imaging,1,NaN,NaN,NaN,2008
1027,Imaging,1,NaN,NaN,19.2,2011
1029,Imaging,1,NaN,NaN,10.1,2012

Para modificar el orden existe la propiedad ``na_position`` en la que se puede indicar si estos han de estar la principio. Así, para que los nulos sean los primero simplemente se ha de ejecutar la siguiente línea.

In [9]:
# Ordenar y comenzar con los datos NAN en el campo de 'orbital_period'
df_planetas.sort_values('orbital_period', na_position='first')

      method  number  orbital_period  mass  distance  year
29   Imaging       1             NaN   NaN     45.52  2005
30   Imaging       1             NaN   NaN    165.00  2007
31   Imaging       1             NaN   NaN    140.00  2004
33   Imaging       1             NaN   NaN       NaN  2008
34   Imaging       1             NaN   NaN    145.00  2013
..       ...     ...             ...   ...       ...   ...
900  Imaging       1         40000.0   NaN       NaN  2011
644  Imaging       4         69000.0   NaN     39.94  2008
643  Imaging       4        170000.0   NaN     39.94  2008
68   Imaging       1        318280.0   NaN      7.69  2008
937  Imaging       1        730000.0   NaN       NaN  2006

[1035 rows x 6 columns]

## Ordenar el propio dataframe

En los ejemplos anteriores se puede ver que al ordenarse los datos se ha creado en todo momento un objeto nuevo. En caso de que no se desee este comportamiento se puede indicar mediante la opción inplace que se ordene el propio objeto. Con lo que se evita aumentar la memoria consumida por el programa. Así para ordenar por año en el propio objeto se puede emplear.

In [10]:
# Ordenar por año y actulizar el dataframe
df_planetas.sort_values('year', inplace=True)

In [11]:
#Mostramos el DataFrame
df_planetas

              method  number  orbital_period    mass  distance  year
441  Radial Velocity       1       83.888000  11.680     40.57  1989
942    Pulsar Timing       3       66.541900     NaN       NaN  1992
941    Pulsar Timing       3       25.262000     NaN       NaN  1992
943    Pulsar Timing       3       98.211400     NaN       NaN  1994
16   Radial Velocity       1        4.230785   0.472     15.36  1995
..               ...     ...             ...     ...       ...   ...
846          Transit       2       15.965400     NaN       NaN  2014
847          Transit       2      179.612000     NaN       NaN  2014
849          Transit       4        6.164860     NaN       NaN  2014
851          Transit       4       23.980200     NaN       NaN  2014
840          Transit       3       35.333100     NaN       NaN  2014

[1035 rows x 6 columns]

## Ordenar el dataframe en base al índice

En el caso de querer volver a la situación original se puede ordenar el conjunto de datos en base al índice. Lo que requiere utilizar la propiedad ``sort_index()``, al que por defecto no hay que pasarle ningún parámetro.

In [12]:
#Ordenar basado en el indice
df_planetas.sort_index()

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

## Ordenar por los valores de más de una columna

Finalmente puede ser necesario ordenar los valores por más de una columna. Primero por una y luego por otra. Esto se puede hacer indicando al método sort_values() un vector de columnas en lugar de una cadena de texto. Por ejemplo, se pueden ordenar los planetas por año y periodo orbital el siguiente resultado. (En este se puede ver que los planetas descubiertos en el 1992 hay dos que están ordenados por su periodo.)

In [13]:
#Ordenar el dataframe basado en 'year' y despues en 'orbital_period'
df_planetas.sort_values(['year', 'orbital_period'])

                        method  number  orbital_period    mass  distance  year
441            Radial Velocity       1       83.888000  11.680     40.57  1989
941              Pulsar Timing       3       25.262000     NaN       NaN  1992
942              Pulsar Timing       3       66.541900     NaN       NaN  1992
943              Pulsar Timing       3       98.211400     NaN       NaN  1994
16             Radial Velocity       1        4.230785   0.472     15.36  1995
..                         ...     ...             ...     ...       ...   ...
829            Radial Velocity       2     1460.000000     NaN       NaN  2014
893            Radial Velocity       2     3000.000000     NaN       NaN  2014
501            Radial Velocity       2     3452.000000   2.580     68.54  2014
440            Radial Velocity       1     3827.000000   0.480     20.48  2014
749  Transit Timing Variations       3             NaN     NaN       NaN  2014

[1035 rows x 6 columns]

Ahora agrupando el método y el periodo orbital

In [14]:
#Ordenar el dataframe basado en 'method' y despues en 'orbital_period'
df_planetas.sort_values(['method', 'orbital_period'])

                        method  number  orbital_period  mass  distance  year
113                 Astrometry       1       246.36000   NaN     20.77  2013
537                 Astrometry       1      1016.00000   NaN     14.98  2010
44   Eclipse Timing Variations       2      1916.25000   NaN       NaN  2011
40   Eclipse Timing Variations       2      2883.50000   NaN    500.00  2010
41   Eclipse Timing Variations       1      2900.00000   NaN       NaN  2011
..                         ...     ...             ...   ...       ...   ...
824                    Transit       7       331.60059   NaN    780.00  2013
813  Transit Timing Variations       2        22.33950   NaN    339.00  2013
736  Transit Timing Variations       2        57.01100   NaN    855.00  2012
680  Transit Timing Variations       2       160.00000   NaN   2119.00  2011
749  Transit Timing Variations       3             NaN   NaN       NaN  2014

[1035 rows x 6 columns]

Ordenando el periodo orbital de manera descendente

In [15]:
#Utilizar la opcion ascending=[True,False]
df_planetas.sort_values(['method', 'orbital_period'], ascending=[True, False])

                        method  number  orbital_period  mass  distance  year
537                 Astrometry       1       1016.0000   NaN     14.98  2010
113                 Astrometry       1        246.3600   NaN     20.77  2013
32   Eclipse Timing Variations       1      10220.0000  6.05       NaN  2009
43   Eclipse Timing Variations       2       5840.0000   NaN       NaN  2011
37   Eclipse Timing Variations       2       5767.0000   NaN    130.72  2008
..                         ...     ...             ...   ...       ...   ...
794                    Transit       1          0.3550   NaN       NaN  2013
680  Transit Timing Variations       2        160.0000   NaN   2119.00  2011
736  Transit Timing Variations       2         57.0110   NaN    855.00  2012
813  Transit Timing Variations       2         22.3395   NaN    339.00  2013
749  Transit Timing Variations       3             NaN   NaN       NaN  2014

[1035 rows x 6 columns]

# Valores únicos

En el conjunto de datos de exoplanetas existe una columna con el método utilizado para su descubrimiento. Por lo que puede ser interesante obtener el listado de método únicos utilizados. El método de las columnas de Pandas que permite obtener estos valores es ``unique()``. Así el listado de métodos de descubrimiento de planetas se puede obtener aplicando este método a la columna "method".

In [16]:
#Utilizar  unique() en el campo de 'method'
df_planetas['method'].unique()

array(['Radial Velocity', 'Pulsar Timing', 'Transit', 'Imaging',
       'Microlensing', 'Pulsation Timing Variations',
       'Eclipse Timing Variations', 'Astrometry',
       'Transit Timing Variations', 'Orbital Brightness Modulation'],
      dtype=object)

En este caso se puede ver que el resultado es un array. En el caso de que desee que el listado de valores sea una lista se puede utilizar el método tolist() para transformarla.

In [17]:
#Utilizar  unique() en el campo de 'method' y pasarlo a lista 
df_planetas['method'].unique().tolist()

['Radial Velocity',
 'Pulsar Timing',
 'Transit',
 'Imaging',
 'Microlensing',
 'Pulsation Timing Variations',
 'Eclipse Timing Variations',
 'Astrometry',
 'Transit Timing Variations',
 'Orbital Brightness Modulation']

Si requerimos la lista ordenada alfabéticamente usamos ``sort_values``

In [18]:
# sort_values('method')
df_planetas['method'].sort_values().unique().tolist()

['Astrometry',
 'Eclipse Timing Variations',
 'Imaging',
 'Microlensing',
 'Orbital Brightness Modulation',
 'Pulsar Timing',
 'Pulsation Timing Variations',
 'Radial Velocity',
 'Transit',
 'Transit Timing Variations']

Si requerimos la lista ordenada por frecuencia usamos ``value_counts()``

In [19]:
# value_counts()
df_planetas['method'].value_counts()

method
Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: count, dtype: int64

Si requerimos la lista ordenada alfabéticamente y ademas su frecuencia usamos ``value_counts()`` y  ``sort_index``

In [20]:
## value_counts() y sort_index()
df_planetas['method'].value_counts().sort_index()

method
Astrometry                         2
Eclipse Timing Variations          9
Imaging                           38
Microlensing                      23
Orbital Brightness Modulation      3
Pulsar Timing                      5
Pulsation Timing Variations        1
Radial Velocity                  553
Transit                          397
Transit Timing Variations          4
Name: count, dtype: int64

El método unique() se puede aplicar también en columnas cuyo contenido sea numérico. Por ejemplo, en la columna "year".

In [21]:
# unique()
df_planetas['year'].unique().tolist()

[1989,
 1992,
 1994,
 1995,
 1996,
 1997,
 1998,
 1999,
 2000,
 2001,
 2002,
 2003,
 2004,
 2005,
 2006,
 2007,
 2008,
 2009,
 2010,
 2011,
 2012,
 2013,
 2014]

# Tarea
##  Parte 1
Utilizar el siguiente dataframe para resolver los ejercicios 1 al 4

In [22]:
# lista de paises
list = [['Afghanistan', 1952, 8425333, 'Asia'],
            ['France', 1957, 44310863, 'Europe'],
            ['Australia', 1957, 9712569, 'Oceania'],
            ['India', 1952, 3.72e+08, 'Asia'],
            ['Brazil', 1962, 76039390, 'Americas'],
            ['China', 1957, 637408000, 'Asia'],
            ['United States', 1957, 171984000, 'Americas'],
            ['Croatia', 1960, None ,'Europe']
       ]
  
# Dataframe
df = pd.DataFrame(list, columns=['Country', 'Year','Population', 'Continent'])
  
df

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
1         France  1957   44310863.0    Europe
2      Australia  1957    9712569.0   Oceania
3          India  1952  372000000.0      Asia
4         Brazil  1962   76039390.0  Americas
5          China  1957  637408000.0      Asia
6  United States  1957  171984000.0  Americas
7        Croatia  1960          NaN    Europe

<div class="alert alert-success">

<b>EJERCICIO 1</b>: 
Obtener la misma salida    
</div>

<img align="left" width="300"  float= "none" align="middle" src="figuras/ejercicio1.png">

In [23]:
df.sort_values('Country')

         Country  Year   Population Continent
0    Afghanistan  1952    8425333.0      Asia
2      Australia  1957    9712569.0   Oceania
4         Brazil  1962   76039390.0  Americas
5          China  1957  637408000.0      Asia
7        Croatia  1960          NaN    Europe
1         France  1957   44310863.0    Europe
3          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas

<div class="alert alert-success">

<b>EJERCICIO 2</b>: 
Obtener la misma salida    
</div>

<img align="left" width="300"  float= "none" align="middle" src="figuras/ejercicio2.png">

In [24]:
df.sort_values('Population', ascending=False)

         Country  Year   Population Continent
5          China  1957  637408000.0      Asia
3          India  1952  372000000.0      Asia
6  United States  1957  171984000.0  Americas
4         Brazil  1962   76039390.0  Americas
1         France  1957   44310863.0    Europe
2      Australia  1957    9712569.0   Oceania
0    Afghanistan  1952    8425333.0      Asia
7        Croatia  1960          NaN    Europe

<div class="alert alert-success">

<b>EJERCICIO 3</b>: 
Obtener la misma salida    
</div>

<img align="left" width="300"  float= "none" align="middle" src="figuras/ejercicio3.png">

In [25]:
df.sort_values('Population', na_position='first')

         Country  Year   Population Continent
7        Croatia  1960          NaN    Europe
0    Afghanistan  1952    8425333.0      Asia
2      Australia  1957    9712569.0   Oceania
1         France  1957   44310863.0    Europe
4         Brazil  1962   76039390.0  Americas
6  United States  1957  171984000.0  Americas
3          India  1952  372000000.0      Asia
5          China  1957  637408000.0      Asia

<div class="alert alert-success">

<b>EJERCICIO 4</b>: 
Obtener la misma salida    
</div>

<img align="left" width="300"  float= "none" align="middle" src="figuras/ejercicio4.png">

In [26]:
df.sort_values(['Continent', 'Country'], ascending=[False, True])

         Country  Year   Population Continent
2      Australia  1957    9712569.0   Oceania
7        Croatia  1960          NaN    Europe
1         France  1957   44310863.0    Europe
0    Afghanistan  1952    8425333.0      Asia
5          China  1957  637408000.0      Asia
3          India  1952  372000000.0      Asia
4         Brazil  1962   76039390.0  Americas
6  United States  1957  171984000.0  Americas